# NoUptoRoofForWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinRoofFailures..::..NoUptoRoofForWall Property
BuiltInFailures..::..WallJoinRoofFailures Class See Also
---
Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoUptoRoofForWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoUptoRoofForWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoUptoRoofForWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace